
poets = {'Σεφέρης':{'Νόμπελ':1963,
                    'Βιβλία':{'Στροφή':1931,
                              'Στέρνα':1932},
                    'Γ':1900,
                    'Θ':1971},
         'Ελύτης':{'Νόμπελ':1979,
                   'Βιβλία':{'Ο Ήλιος ο Πρώτος':1943,
                             'Άξιον Εστί':1960},
                   'Γ':1911,
                   'Θ':1996},
         'Βρεττάκος':{'Νόμπελ':'-',
                      'Βιβλία':{'Η παραμυθένια Πολιτεία':1947,
                                'Ωδή στον ήλιο':1974},
                      'Γ':1912,
                      'Θ':1991}
         }
      
 
for x in poets.items():
    print(x[0],x[1]['Νόμπελ'])

name=input('Ονομα: ')
print(poets.get(name,'Δεν περιλαμβάνεται'))
